# Operações

Há muitas operações com pandas que serão realmente úteis para você, mas não se enquadram em nenhuma categoria distinta. Vamos mostrar aqui nesta aula:

In [1]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

informação do tipo de dado de cada linha

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [3]:
df.memory_usage()

Index    128
col1      32
col2      32
col3      32
dtype: int64

### Informação sobre valores exclusivos

In [4]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [5]:
df['col2'].unique()

array([444, 555, 666])

In [6]:
df['col2'].nunique()# numero de valores unicos

3

In [7]:
df['col2'].value_counts()# conta valores =s de cada tipo

444    2
555    1
666    1
Name: col2, dtype: int64

### Selecionando dados

In [8]:
# Selecione do DataFrame usando critérios de várias colunas
newdf = df[(df['col1']>2) & (df['col2']==444)]

In [9]:
newdf

   col1  col2 col3
3     4   444  xyz

In [10]:
df[df['col2'] == 444]

   col1  col2 col3
0     1   444  abc
3     4   444  xyz

In [11]:
df[df['col2'] == 444]['col1'].sum()

5

### Aplicando funções

In [12]:
def comp(x):
    return x +1

In [13]:
df['col1'].apply(comp)

0    2
1    3
2    4
3    5
Name: col1, dtype: int64

In [14]:
df['Soma 1'] = df['col1'].apply(comp)

In [15]:
df

   col1  col2 col3  Soma 1
0     1   444  abc       2
1     2   555  def       3
2     3   666  ghi       4
3     4   444  xyz       5

In [16]:
df['Soma 2'] = df['col1'].apply(lambda x: x+2)

In [17]:
df

   col1  col2 col3  Soma 1  Soma 2
0     1   444  abc       2       3
1     2   555  def       3       4
2     3   666  ghi       4       5
3     4   444  xyz       5       6

___

In [18]:
def times2(x):
    return x*2

In [19]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

## Operações

In [20]:
df

   col1  col2 col3  Soma 1  Soma 2
0     1   444  abc       2       3
1     2   555  def       3       4
2     3   666  ghi       4       5
3     4   444  xyz       5       6

In [21]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [22]:
df['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [23]:
df['col1'].sum()

10

In [24]:
df['col1'].count()

4

In [25]:
df['col1'].product()

24

In [26]:
df['col1'].mean()

2.5

In [27]:
df['col1'].std()

1.2909944487358056

In [28]:
df['col1'].max()

4

In [29]:
df['col1'].min()

1

In [30]:
df['col1'].idxmax()# indece max

3

In [31]:
df['col1'].idxmin()

0

In [32]:
df['col1'].add(1)

0    2
1    3
2    4
3    5
Name: col1, dtype: int64

In [33]:
df['col1'].sub(1)

0    0
1    1
2    2
3    3
Name: col1, dtype: int64

In [34]:
df['col1'].mul(2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [35]:
df['col1'].div(2)

0    0.5
1    1.0
2    1.5
3    2.0
Name: col1, dtype: float64

In [36]:
del df['col1']

In [37]:
df

   col2 col3  Soma 1  Soma 2
0   444  abc       2       3
1   555  def       3       4
2   666  ghi       4       5
3   444  xyz       5       6

Nomes de coluna e índice

In [38]:
df.columns

Index(['col2', 'col3', 'Soma 1', 'Soma 2'], dtype='object')

In [39]:
df.index

RangeIndex(start=0, stop=4, step=1)

## Ordenando um DataFrame

In [40]:
df

   col2 col3  Soma 1  Soma 2
0   444  abc       2       3
1   555  def       3       4
2   666  ghi       4       5
3   444  xyz       5       6

In [41]:
df.sort_values(by='col2') #inplace=False por padrão

   col2 col3  Soma 1  Soma 2
0   444  abc       2       3
3   444  xyz       5       6
1   555  def       3       4
2   666  ghi       4       5

## Valores Nulos

In [42]:
df.isnull()

    col2   col3  Soma 1  Soma 2
0  False  False   False   False
1  False  False   False   False
2  False  False   False   False
3  False  False   False   False

In [43]:
# Deleta linhas com valores NaN
df.dropna()

   col2 col3  Soma 1  Soma 2
0   444  abc       2       3
1   555  def       3       4
2   666  ghi       4       5
3   444  xyz       5       6

** Preenchendo os valores de NaN com outra coisa: **

In [44]:
import numpy as np

In [45]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [46]:
df.fillna('Preencher')

        col1       col2 col3
0        1.0  Preencher  abc
1        2.0      555.0  def
2        3.0      666.0  ghi
3  Preencher      444.0  xyz

## MAP

In [47]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [48]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [49]:
dict_map = {'one' :"1", 'two' : '2'}

In [50]:
df['B'].map(dict_map)

0    1
1    1
2    2
3    2
4    1
5    1
Name: B, dtype: object

In [51]:
df['E'] = df['B'].map(dict_map)

In [52]:
df

     A    B  C  D  E
0  foo  one  x  1  1
1  foo  one  y  3  1
2  foo  two  x  2  2
3  bar  two  y  5  2
4  bar  one  x  4  1
5  bar  one  y  1  1

In [53]:
dicionario_map = {
    'foo': 'fu',
    'bar': 'bah',
}

In [54]:
df['A'].map(dicionario_map)

0     fu
1     fu
2     fu
3    bah
4    bah
5    bah
Name: A, dtype: object

## where

In [61]:
df

     A    B  C  D  E
0  foo  one  x  1  1
1  foo  one  y  3  1
2  foo  two  x  2  2
3  bar  two  y  5  2
4  bar  one  x  4  1
5  bar  one  y  1  1

In [55]:
condicao = df == 'one'

In [56]:
df.where(condicao, 0)

   A    B  C  D  E
0  0  one  0  0  0
1  0  one  0  0  0
2  0    0  0  0  0
3  0    0  0  0  0
4  0  one  0  0  0
5  0  one  0  0  0

## Pivot

In [57]:
df

     A    B  C  D  E
0  foo  one  x  1  1
1  foo  one  y  3  1
2  foo  two  x  2  2
3  bar  two  y  5  2
4  bar  one  x  4  1
5  bar  one  y  1  1

In [58]:
df.pivot_table(index="A", columns="B", values="D")

B    one  two
A
bar  2.5  5.0
foo  2.0  2.0

In [59]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

## Copia sem ser ponteiro

In [60]:
df.copy()

     A    B  C  D  E
0  foo  one  x  1  1
1  foo  one  y  3  1
2  foo  two  x  2  2
3  bar  two  y  5  2
4  bar  one  x  4  1
5  bar  one  y  1  1